tutorials/modules/CHT/multiphaseCoolingCylinder2D/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     foamMultiRun;

regionSolvers
{
    fluid           multiphaseEuler;
    solid           solid;
}

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         5;

deltaT          1e-4;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  8;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           0.25;

maxDi           200;

maxDeltaT       1;

functions
{
    #includeFunc patchAverage
    (
        funcName=cylinderToil,
        region=fluid,
        patch=fluid_to_solid,
        field=T.oil
    )

    #includeFunc patchAverage
    (
        funcName=cylinderTwater,
        region=fluid,
        patch=fluid_to_solid,
        field=T.water
    )
}


// ************************************************************************* //
